{"Job_ID":{"0":"3879301587","1":"3820479502","2":"3890442134","3":"3876416396","4":"3780614897","5":"3771637074","6":"3900798064","7":"3893119219","8":"3843041729","9":"3882844672","10":"3888577120","11":"3879301571","12":"3829053920","13":"3900502509","14":"3903524965","15":"3849949342","16":"3775187042","17":"3783567440","18":"3888052027","19":"3751241217","20":"3794624979","21":"3883629706","22":"3897134160","23":"3814291603","24":"3852827878"},"url":{"0":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3879301587","1":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3820479502","2":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3890442134","3":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3876416396","4":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3780614897","5":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3771637074","6":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3900798064","7":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3893119219","8":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3843041729","9":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3882844672","10":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3888577120","11":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3879301571","12":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3829053920","13":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3900502509","14":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3903524965","15":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3849949342","16":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3775187042","17":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3783567440","18":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3888052027","19":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3751241217","20":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3794624979","21":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3883629706","22":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3897134160","23":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3814291603","24":"https:\/\/www.linkedin.com\/jobs\/collections\/recommended\/?currentJobId=3852827878"},"Job_txt":{"0":"","1":"","2":"Software Developer RiDiK (a Subsidiary of CLPS. Nasdaq: CLPS) Singapore, Singapore 1 week ago 164 applicants See who RiDiK (a Subsidiary of CLPS. Nasdaq: CLPS) has hired for this role Apply Save Save job Save this job with your existing LinkedIn profile, or create a new one. .  Sign in to save Software Developer at RiDiK (a Subsidiary of CLPS. Nasdaq: CLPS) . Email or phone Password Show Forgot password? Sign in Report this job Direct message the job poster from RiDiK (a Subsidiary of CLPS. Nasdaq: CLPS) Anjali Panda Anjali Panda HR Professional #hiringnow #hiringalert Hello Connections!!! I am hiring for position for Software Developer(Java\/Big Data) @Singapore location If interested please send your updated resume to anjali@ridik.net Qualifications and Profile Mandatory At least 8 years in Software development At least 5 years in Java\/J2EE development Hands on Data ingest and data processing technology like Spark streaming and Spark Hands on Messaging systems like Kafka, Flume or ActiveMQ, MQSeries or RabitMQ Hands on knowledge on Hadoop (preferably Hortonworks distribution) - HDFS, HBase, Hive, ORC\/Parquet. Build tool - Maven\/sbt\/ant, UML, Restful web services, Jenkins\/Team City, Source management – SVN\/GIT, TDD using Junit, Jira\/QC. Good to Have Solution design using proven patterns, awareness of anti-patterns, performance tuning, especially in streaming Knowledge of tools like Phoenix, ElasticSearch, Sqoop, StreamSets are good to have. Basic understanding of finance and investment banking Other Professional Skills and Mindset Excellent written and verbal communication skills for both team mates and management Strong analytical and problem solving skills Proficient software development life cycle Appetite to follow technology trend and participate to communities Passion for sharing expertise and grow team members’s skills Interest in mentoring and guiding junior team members on the path of high quality deliverables. @Srustijeet Mishra @Sibashis Routray @Hyma M Show more Show less Seniority level Associate Employment type Contract Job function Information Technology Industries IT Services and IT Consulting Referrals increase your chances of interviewing at RiDiK (a Subsidiary of CLPS. Nasdaq: CLPS) by 2x See who you know","3":"","4":"","5":"Software Engineer Intern, Business Infrastructure - 2024 Start TikTok Singapore 2 months ago 177 applicants See who TikTok has hired for this role Apply Join or sign in to find your next job Join to apply for the Software Engineer Intern, Business Infrastructure - 2024 Start role at TikTok Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? . .  Sign in to save Software Engineer Intern, Business Infrastructure - 2024 Start at TikTok . Email or phone Password Show Forgot password? Sign in Report this job Responsibilities TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Singapore, Jakarta, Seoul and Tokyo. Why Join Us Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible. Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day. To us, every challenge, no matter how difficult, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. At TikTok, we create together and grow together. That's how we drive impact - for ourselves, our company, and the communities we serve. Join us. We are looking for talented individuals to join us for an internship in 2024. Internships at TikTok aim to offer students industry exposure and hands-on experience. Watch your ambitions become reality as your inspiration brings infinite opportunities at TikTok. Successful candidates must be able to commit to one of the following internship cycles below: 1. Summer Internship - 06 May 2024 to 26 July 2024 (12 weeks) 2. Off cycle \/ Credit bearing - Starting 08 January 2024 or 12 August 2024 We will prioritize candidates who are able to commit in either internship period. Please state your availability clearly in your resume (Start date, End date). Candidates can apply to a maximum of two positions and will be considered for jobs in the order you apply. The application limit is applicable to TikTok and its affiliates' jobs globally. Applications will be reviewed on a rolling basis - we encourage you to apply early. About the team We part of the Engineering Productivity and Quality Assurance team that is focused on building a DevOps Platform and quality assurance with the aim of being an industry-leading engineering productivity platform and driving the DevOps paradigm landing at ByteDance and its affiliates. As a member of the Business Infrastructure DevOps\/QA team, you will be managing complex challenges at a scale unique to ByteDance using your expertise in coding, complexity analysis and large-scale system design. Our organization brings together people from different backgrounds, experiences and perspectives. We encourage everyone in our team to collaborate, think big and take risks in a blame-free environment. Responsibilities - Build advanced and standardized DevOps\/QA tools or platforms to accelerate R&D efficiency, improving the efficiency and quality of our engineer team; - Be responsible for high-quality design, coding, and tackling highly challenging and technical problems; - Cooperate with product manager, participate in product requirement discussion, function definition, etc. Qualifications - Bachelor's or higher degree in computer science, software engineering or related fields; - Experience in Java\/Golang (go) programming language and familiar with common Linux commands; - Familiar with Mysql or any relational database, with certain SQL writing skills and optimization experience; - Work conscientiously and steadfastly, with strong learning ability and problem-solving ability; TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too. By submitting an application for this role, you accept and agree to our global applicant privacy policy, which may be accessed here: https:\/\/careers.tiktok.com\/legal\/privacy. If you have any questions, please reach out to us at apac-earlycareers@tiktok.com Show more Show less Seniority level Not Applicable Employment type Full-time Job function Research, Information Technology, and Engineering Industries Entertainment Providers Referrals increase your chances of interviewing at TikTok by 2x See who you know","6":"","7":"","8":"Software Engineer Intern Thales Singapore, Singapore 1 month ago Over 200 applicants See who Thales has hired for this role Apply Join or sign in to find your next job Join to apply for the Software Engineer Intern role at Thales Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? . .  Sign in to save Software Engineer Intern at Thales . Email or phone Password Show Forgot password? Sign in Report this job Location: Singapore, Singapore Thales people architect identity management and data protection solutions at the heart of digital security. Business and governments rely on us to bring trust to the billons of digital interactions they have with people. Our technologies and services help banks exchange funds, people cross borders, energy become smarter and much more. More than 30,000 organizations already rely on us to verify the identities of people and things, grant access to digital services, analyze vast quantities of information and encrypt data to make the connected world more secure. Thales established its presence in Singapore in 1973 to support the expansion of aerospace-related activities in the Asia-Pacific region. Throughout the last four decades, the company grew from strength to strength and is today involved in the primary businesses of Aerospace (including Air Traffic Management), Defence & Security, Ground Transportation and Digital Identity & Security. Thales today employs over 2,100 people in Singapore across all its business areas. Introduction As a Software Engineer in the Product Engineer team, you will participate in Personalization Delivery on production machine, and the design & implementation of standalone\/web application for internal usage. Scope [Main] Collaborate with other NPI engineers to develop recurrent banking product configurations. Conduct validation campaign on banking configurations. [Secondary] Create (standalone or web) tools for internal usage. Requirements Bachelor of Science in Electrical and Electronic Engineering\/Computer Science Able to commit for 5-6 months Programming skills in Java or Python. Experience with microcontroller\/ microprocessor (assembly language) is an edge. Critical thinker and problem-solving skills. Learning Outcomes Understand the full software development life cycle from planning, development, testing to integration. Be mentored by experienced product & software engineers. At Thales we provide CAREERS and not only jobs. With Thales employing 80,000 employees in 68 countries our mobility policy enables thousands of employees each year to develop their careers at home and abroad, in their existing areas of expertise or by branching out into new fields. Together we believe that embracing flexibility is a smarter way of working. Great journeys start here, apply now! Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries Aviation and Aerospace Component Manufacturing and Defense and Space Manufacturing Referrals increase your chances of interviewing at Thales by 2x See who you know","9":"IT Systems Engineer Crone Corkill Singapore, Singapore 2 weeks ago Over 200 applicants See who Crone Corkill has hired for this role Apply Save Save job Save this job with your existing LinkedIn profile, or create a new one. .  Sign in to save IT Systems Engineer at Crone Corkill . Email or phone Password Show Forgot password? Sign in Report this job Direct message the job poster from Crone Corkill Joseph Barwick-Knight Joseph Barwick-Knight Executive Consultant at Crone Corkill IT Systems Engineer $12,500 SGD - $15,833 SGD per month Full time – Marina Bay – Hybrid Is this the IT Systems Engineer role for you? Crone Corkill are partnering with a rapidly growing Hedge Fund as they look to expand their operations in Singapore and the wider APAC region. With members of the Systems team based across the globe, this position requires you to have a global mindset beyond just APAC. You’ll be working in a dynamic environment that requires focus on uptime, availability and standardisation, ensuring constant support & maintenance of their virtualised VSI & VDI environment using VMware. Being the sole SysOps Engineer in Singapore, you’ll be required to work independently, communicate effectively and occasionally support local Helpdesk teams. Prior experience working in Hedge Funds, Investment Management\/Banking, Private Equity, etc is essential . What will you do as an IT Systems Engineer? Provide expertise with VMware VDI (Horizon) Offer a deep understanding of Windows 10 image creation & deployment Patching and software deployments in a fully virtualised environment Manage Windows core Infrastructure (Active Directory, GPOs, DHCP, DNS, DFS, PKI management) Manage Windows endpoints (10\/11) Support their Hybrid environments, running on-prem services alongside O365 & Azure Mobile Device Management (MDM) – preferably Intune Manage Windows Server 2019\/2022 Automate tasks using PowerShell scripts (App packaging, scripting, batch files, etc) Support APAC Helpdesk teams Collaborate with the global Systems team What skills do you need to be an IT Systems Engineer? VMware VSI & VDI Windows 10 image creation & deployments Office 365 Azure AD (Active Directory) Azure AD (AAD) Managing Windows core Infrastructure Intune PowerShell Rubrik (Backups) or Zerto (Replication) Working knowledge of NetApp What’s in it for you? In return, you’ll be joining a rapidly growing firm who are still at the relatively early stages of growth. They’ve expanded drastically in recent years and will give you the opportunity to lead the way from the APAC area, whilst also working closely with colleagues in North America & EMEA. Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Information Technology Industries Capital Markets, Venture Capital and Private Equity Principals, and Investment Management Referrals increase your chances of interviewing at Crone Corkill by 2x See who you know","10":"","11":"Software Engineer e2i, Employment & Employability Institute Singapore, Singapore 3 weeks ago Over 200 applicants See who e2i, Employment & Employability Institute has hired for this role Apply Save Save job Save this job with your existing LinkedIn profile, or create a new one. .  Sign in to save Software Engineer at e2i, Employment & Employability Institute . Email or phone Password Show Forgot password? Sign in Report this job e2i helps our corporate partners to hire Singaporean or Singapore PR and below is our corporate partner's profile: Our partner is a Fortune 500 global IT services leader dedicated to delivering excellence for our customers and colleagues. The company helps global companies run mission-critical systems and operations while modernizing IT, optimizing data architectures, and ensuring security and scalability across public, private, and hybrid clouds. Job description Understand operation business needs and translate them into technical requirements. Responsible for developing workflows and applications within the ServiceNow platform, which supports the streamlining and automation of business processes. Responsible for developing and maintaining integrations between the ServiceNow platform and external systems. To support post-implementation tasks including, troubleshooting, administration, patching and upgrades. Job requirement Degree in Computer Science, Computer Engineering, Software Engineering, or related discipline. Should have 6 months - 2 years of experience in scripting\/ programming in any ITSM tools Should have a strong interest in scripting\/ programming using HTML, CSS, JavaScript, JQuery or Angular JS. Strong analytical \/problem-solving skills. Good communication skills with strong people skills. Comfortable working with geographically dispersed offshore and cross-functional teams. Proactive attitude, willing to take up challenges to learn new systems and processes. Certification in any ITSM\/ServiceNow will be a plus. Know the Agile sprint method will be a plus Only for Singaporean and Singapore PR Show more Show less Seniority level Executive Employment type Full-time Job function Engineering and Information Technology Industries Technology, Information and Media Referrals increase your chances of interviewing at e2i, Employment & Employability Institute by 2x See who you know","12":"Junior Software Engineer Capgemini Singapore, Singapore 1 month ago Over 200 applicants See who Capgemini has hired for this role Apply Save Save job Save this job with your existing LinkedIn profile, or create a new one. .  Sign in to save Junior Software Engineer at Capgemini . Email or phone Password Show Forgot password? Sign in Report this job About Capgemini :- Capgemini is a global leader in consulting, digital transformation, technology and engineering services. The Group is at the forefront of innovation to address the entire breadth of clients’ opportunities in the evolving world of cloud, digital and platforms. Building on its strong 50-years+ heritage and deep industry-specific expertise, Capgemini enables organizations to realize their business ambitions through an array of services from strategy to operations. Capgemini is driven by the conviction that the business value of technology comes from and through people. Today, it is a multicultural company with 360,000+ team members in almost 50+ countries. The Group reported in 2022 combined revenues of €22billion. Capgemini's looking for next-gen tech talent in Singapore! Interested in bridging the gap between vision & reality with code? Role- Junior Software Engineer (Next Generation Talent) Location - Marina Bay Financial Centre, Singapore Do you thrive on bringing ideas to life through code? Imagine collaborating with diverse stakeholders to grasp complex business needs and translating them into elegant software solutions. This role offers you the chance to make a real impact through the power of technology. What You'll Do: · Bridge the Gap: Unravel business requirements and translate them into clear technical specifications. · Craft with Precision: Develop and refine software applications, ensuring exceptional functionality and performance. · Maintain & Optimize: Nurture existing applications, keeping them efficient and secure. · Test with Confidence: Execute rigorous testing across all levels, guaranteeing reliability and usability. · Automate for Success: Streamline deployments with configuration management and automation tools. · Innovate & Improve: Continuously identify opportunities to enhance systems and user experience. What You Bring: · Solid Foundation: A Computer Science or related Engineering degree equips you with the technical prowess. · Sharp & Eager: Recent graduate or up to 2 years of hands-on experience showcase your agility. · Frontend Expertise: Master the art of user interfaces with frameworks like HTML5, Angular, or React JS. · Backend Powerhouse: Command backend languages like Java, .NET, Python, or PHP. · Data Adeptness: Database proficiency is a valuable bonus. · Full-Stack Potential: Experience in both frontend and backend development gives you an edge. · Cloud Enthusiast: Familiarity with Cloud Platforms- AWS, Azure, GCP would be additional asset. Ready to develop, refine software, collaborate with diverse teams, & make a real impact.? Join our team and make a meaningful impact! Let's talk about what's in it for you! Passionate people are Capgemini's Ace of Spades - join us to discover a career that will challenge, support and inspire you. Working at Capgemini you'll find the rewards are more than just financial. You will work alongside some very smart and inspiring people on exciting projects and you will also enjoy incredible benefits. We offer flexible work practices and 40 hours of self-development every year with a huge selection of learning opportunities to choose from. As \"Architects of Positive Futures\", Capgemini actively supports the community in 3 ways: Diversity and Inclusion - we believe diversity of thought fuels excellence and innovation, which is why we positively encourage applications from suitably qualified candidates regardless of their gender identity, ethnicity, sexual orientation, religion, ability, intersex status or age. To support our commitment to diversity and inclusion, we celebrate special events and days of significance that are important to our employees such as Diwali, Bastille Day, Pride, IDAHOBIT, IWD and International day of people with Disabilities. Our Employee Resource Groups Women@Capgemini and OutFront support the grassroots passion of employees to drive our diversity agenda and effect change. Digital inclusion - at Capgemini we are using our skills to drive social impact initiatives focusing on helping society address the impact of the digital and automation revolution. We also provide employees with opportunities to give back to the community through charity projects and volunteer days. Environmental Sustainability - Capgemini joined the CDP's (Carbon Disclosure Project) prestigious \"A list\" for its commitment to the Net-Zero economy. We are focusing on helping our clients transform towards more sustainable business models and committing to reduce our own carbon emissions (GHG) by 20% per employee by 2020. Recognized by Ethisphere as one of the World's Most Ethical Companies for the last 8 years in a row, ethics and values are at the heart of Capgemini's corporate culture and business. Embedded in our DNA, our seven values - Honesty, Boldness, Trust, Team Spirit, Freedom, Fun and Modesty - have remained the same since company inception in 1967. To see how we bring these values to life, click here to listen to some of our employee’s stories. Come join us, bring your whole self to work, create new possibilities for you, your customers and your community and help us to be Architects of Positive Futures. Show more Show less Seniority level Entry level Employment type Full-time Job function Consulting, Engineering, and Information Technology Industries Information Services, IT Services and IT Consulting, and Technology, Information and Media Referrals increase your chances of interviewing at Capgemini by 2x See who you know","13":"","14":"Full Stack Software Engineer Intern (6 months) Hypotenuse AI Singapore 6 days ago 162 applicants See who Hypotenuse AI has hired for this role Apply Save Save job Save this job with your existing LinkedIn profile, or create a new one. .  Sign in to save Full Stack Software Engineer Intern (6 months) at Hypotenuse AI . Email or phone Password Show Forgot password? Sign in Report this job About Us Hypotenuse AI is an AI content marketing platform that manages and automates content writing for companies, including product descriptions, advertising text, and blog posts. We're reshaping what takes weeks to do, and turning it into days. Our mission is to power the world's content creation—making it easy, relevant and personal. We’re building the state-of-the-art in machine learning, with an experienced team from FAANG\/AI research and top startups, and are backed by top global investors such as Y Combinator. We have global ambitions and are expanding our team in Singapore. If you're looking for a fast-paced start-up with the opportunity to reshape an industry, come join us! Job Description At Hypotenuse, interns aren’t here to sit on the sidelines or buy coffee. We empower you to make decisions, contribute creatively and think critically. We want self-starters who are entrepreneurial and want a taste of working in a high-growth, fast-moving start-up. As a software engineer intern at Hypotenuse, your role will span across the full platform, touching on frontend, backend, DevOps and gaining exposure to machine learning models for computer vision and NLP. Responsibilities include - Design, develop and maintain applications that are efficient and can handle high traffic - Design and build APIs\/back-end architectures for stable and highly available applications - Quickly iterate and improve on our application according to user feedback - Write reusable and reliable code with high test coverage Requirements: - Ideally able to commit full-time for 6 months or more - Good knowledge of HTML, CSS, and Javascript - Experience with web frameworks — both on the client-side (e.g. React, Angular, Vue, ..) and server side (e.g. Flask \/ FastAPI \/ Django) - Understanding of algorithms\/data structures and computer science fundamentals - Strong written and verbal communication skills - High adaptability and strong problem-solving skills - UX design sensibility Show more Show less Seniority level Internship Employment type Full-time Job function Engineering and Information Technology Industries Software Development Referrals increase your chances of interviewing at Hypotenuse AI by 2x See who you know","15":"","16":"2024 Blackstone Technology and Innovations - Software Engineering Intern (Jul to Dec 2024), Singapore Blackstone Singapore 2 weeks ago Over 200 applicants See who Blackstone has hired for this role Apply Join or sign in to find your next job Join to apply for the 2024 Blackstone Technology and Innovations - Software Engineering Intern (Jul to Dec 2024), Singapore role at Blackstone Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? . .  Sign in to save 2024 Blackstone Technology and Innovations - Software Engineering Intern (Jul to Dec 2024), Singapore at Blackstone . Email or phone Password Show Forgot password? Sign in Report this job Blackstone is the world’s largest alternative asset manager. We seek to create positive economic impact and long-term value for our investors, the companies we invest in, and the communities in which we work. We do this by using extraordinary people and flexible capital to help companies solve problems. Our $1 trillion in assets under management include investment vehicles focused on private equity, real estate, public debt and equity, infrastructure, life sciences, growth equity, opportunistic, non-investment grade credit, real assets and secondary funds, all on a global basis. Further information is available at www.blackstone.com. Follow @blackstone on LinkedIn, Twitter, and Instagram. Innovations Profile: Blackstone Technology and Innovations (BXTI) is the technology team at the core of each of Blackstone’s businesses and new growth initiatives. Serving both internal and external clients, we work to build the next generation of systems that manage risk, create efficiency and improve transparency within the firm and across our broad community of investors and portfolio companies. BXTI is nimble and entrepreneurial – our open, iterative design processes and rapid pace of development mean that everyone on the team has the opportunity to make an impact from day one. We are problem solvers who can take projects from idea to implementation. We believe in active mentoring and developing excellence. We collaborate to find the best answers for our customers and for Blackstone. We are critical to the firm maintaining its competitive edge. Your Role: The BXTI Alternative Asset Management Technology team is looking for a 6-month Engineering intern to join in 2024, who can commit to full-time employment from July to December 2024. As a full stack software engineer, you’ll develop innovative technologies that are changing the Alternative Asset Management industry. You’ll work with other engineers and business analysts across Singapore and New York to design, build, deploy, and support Blackstone Innovations' suite of applications. Our custom-built applications are mostly developed in Python or C# on the .NET platform with JavaScript\/React\/Node.js and hosted within AWS. We take full advantage of cloud native container-based and serverless architectures. We also build robust data pipelines connecting to Snowflake for data analysis and visualization. You’ll devise elegant solutions to Blackstone's most meaningful technical challenges and put your own best ideas to work in an entrepreneurial environment inside one of the leading companies in its industry. How you'll make an impact and the tools you'll use to do it: Build web applications, services, and functionality on a variety of platforms Develop on top of AWS in order to build cloud native, serverless first solutions Utilize Docker to create containerized microservices Automate infrastructure configuration using Terraform Use tools such as Airflow, dbt and AWS Step Functions to build data pipelines Integrate various JavaScript libraries such as React to deliver seamless user experiences Design data models and transform data with dbt Optimize and persist data in Snowflake Use TeamCity and Jenkins to automate deployments Write automated unit, integration, and deployment tests Build tooling to automate away repetitive tasks The skills and experience you'll need to make an impact: Object-oriented programming experience in C# or Python SQL experience to work with data in Snowflake Strong analytical, problem solving, critical thinking and decision-making skills, with the ability to multitask and deliver under tight deadlines; the candidate should be a self-starter that thrives on complexity and solution finding A desire to learn and adapt to new technologies A self-starting, entrepreneurial attitude A desire to keep improving Strong interpersonal and communication skills Eligibility: To be considered for the 2024 Software Engineer Program, applicants must meet the following criteria: Currently enrolled as an undergraduate student or graduate student in Computer Science and \/or Engineering majors are preferred, while other majors may be considered Undergraduate, Master (non-MBA) who will be graduate in between December 2024 to June 2025 Commit to working full time for the entire duration of the internship Resume must include expected graduation month and year and GPA Resume must be in PDF format Program Commencement July to December 2024 (6-month, start and end-date can be flexible) The duties and responsibilities described here are not exhaustive and additional assignments, duties, or responsibilities may be required of this position. Assignments, duties, and responsibilities may be changed at any time, with or without notice, by Blackstone in its sole discretion. Blackstone is committed to providing equal employment opportunities to all employees and applicants for employment without regard to race, color, creed, religion, sex, pregnancy, national origin, ancestry, citizenship status, age, marital or partnership status, sexual orientation, gender identity or expression, disability, genetic predisposition, veteran or military status, status as a victim of domestic violence, a sex offense or stalking, or any other class or status in accordance with applicable federal, state and local laws. This policy applies to all terms and conditions of employment, including but not limited to hiring, placement, promotion, termination, transfer, leave of absence, compensation, and training. All Blackstone employees, including but not limited to recruiting personnel and hiring managers, are required to abide by this policy. If you need a reasonable accommodation to complete your application, please contact Human Resources at 212-583-5000 (US), +44 (0)20 7451 4000 (EMEA) or +852 3656 8600 (APAC). Depending on the position, you may be required to obtain certain securities licenses if you are in a client facing role and\/or if you are engaged in the following: Attending client meetings where you are discussing Blackstone products and\/or and client questions; Marketing Blackstone funds to new or existing clients; Supervising or training securities licensed employees; Structuring or creating Blackstone funds\/products; and Advising on marketing plans prepared by a sales team or developing and\/or contributing information for marketing materials. Note: The above list is not the exhaustive list of activities requiring securities licenses and there may be roles that require review on a case-by-case basis. Please speak with your Blackstone Recruiting contact with any questions. To submit your application please complete the form below. Fields marked with a red asterisk * must be completed to be considered for employment (although some can be answered \"prefer not to say\"). Failure to provide this information may compromise the follow-up of your application. When you have finished click Submit at the bottom of this form. Show more Show less Seniority level Internship Employment type Full-time Job function Information Technology Industries Financial Services Referrals increase your chances of interviewing at Blackstone by 2x See who you know","17":"","18":"Software Engineer Internship, Frontend\/Backend (Starting from May preferably) - Nas.io Nas Company Singapore, Singapore 2 weeks ago Over 200 applicants See who Nas Company has hired for this role Apply Save Save job Save this job with your existing LinkedIn profile, or create a new one. .  Sign in to save Software Engineer Internship, Frontend\/Backend (Starting from May preferably) - Nas.io at Nas Company . Email or phone Password Show Forgot password? Sign in Report this job Direct message the job poster from Nas Company Xiaoqi Chu Xiaoqi Chu Vice President of Engineering at Nas Company | Ex-Shopee Who we are: Founded by Nuseir Yassin from Nas Daily (53 million followers), the Nas company is home to Nas Daily, Nas Academy, Nas Studios – and Nas.io. “Nas” means “people” and it has been the foundation of our mission: Bring People Together. People can do more together. They can find friends, mentors, and accountability partners within a community. The single easiest way to change the world is to create tolerant and passionate communities. And communities today have transformed far beyond the traditional concept of a community. a community can be a group of 100 people who come together every week to share and discuss ideas on Zoom. a community can be 25 people flying in from across the world for a yoga retreat every 3 months. a community can be an influencer’s 1,000 true fans learning from each other in a WhatsApp group. a community can be 10,000 NFT holders sharing about events and other projects. As a company, we’ve successfully built communities over and over again – and now, we’ve raised a total of US$23 million to build powerful tools and integrations that will allow other people to build communities faster than ever before. Nas.io is a product for people to have a trustworthy and internationally recognized place to start and manage their communities – including brands, thought leaders, coaches, entrepreneurs, content creators, and DAO builders. With Nas.io, you can have a beautiful home for your community, integrate with the chat platforms your members use, own your community with magic reach, engage your community with rich content, and generate revenue with your community. It’s everything you need, and more! Explore more on https:\/\/nas.io\/ Why work with us: We have set up a strong engineering team with senior members from leading IT companies. You have a growth mindset and thrive in a fast-paced and fun environment. You have the same conviction as us and you want to work hard and grow together with like-minded people. You enjoy working in a diverse and vibrant working environment with people of different cultures. We are a diverse bunch of over 18 different nationalities, spread around the world from Singapore, UAE, India, Pakistan, Israel, South Africa, the Philippines, etc. We won’t let anyone feel alone. We have company-level retreats yearly to gather together. There’s a high chance your current job isn’t exciting for you and that’s why you are looking for something new. We are more than just another usual IT company you might know of. Our ventures extend to the foundation of media, creator education, and community. And we are far from corporate. You love the concept of building communities and are excited about the prospect of building products that will bring people together. You feel very accomplished by creating a larger impact. We give you autonomy to own certain scope and deliver projects\/features from end to end. You enjoy working in a transparent environment where you can have your opinions and push the boundaries. We offer a competitive salary with a substantial share package. If the company is doing well financially, so will you. What we are looking for: 📅 Relevant Technical Experience: Experience with React, Next.js, Node.js, AWS, and MongoDB will be considered a plus, as it aligns with our technology stack and enhances your ability to contribute effectively. 🔍 Good Knowledge and Learning Ability: Demonstrate a strong and deep understanding of best practices in modern web application development and eager to know why. 🚀 Enthusiastic About Solving Engineering Problems: Stay proactive in exploring new technologies, tools, and methodologies to enhance work quality and improve efficiency. 🤝 Collaboration: We value individuals who foster a collaborative environment and actively support their peers in becoming better versions of themselves. Encouraging knowledge sharing, providing guidance, and promoting teamwork are qualities we highly appreciate. 🗣️ Effective Communication and Team Player: Excellent English skills are essential for clear and efficient communication within our global team. We also seek individuals with a high energy level and a great team player attitude, who can contribute positively to our dynamic and collaborative work environment. Tech stack we are mainly using: Frontend: React\/Next.js\/Vercel\/AdminJS\/Flutter Backendr: NodeJS\/Python\/AWS\/MongoDB\/Grafana Stack Dev Tools: Cypress\/Apifox\/Testim\/Jira\/Confluence\/Lark But don’t be limited to them. We are open to change if you have better solutions! Benefits: At Nas Company, we work hard, REALLY HARD! So we value our employees' well-being and believe that a supportive and fulfilling work environment contributes to their success. We're proud to offer a range of benefits that will enhance your professional and personal life. Here's what you can look forward to as part of our team: 💻 Remote Working: For those based in our offices, we provide the flexibility of remote work. Enjoy a balance between the office and your preferred workspace. 🍎 Fully Stocked Fridges: Stay fueled and energized with our fully stocked fridges featuring a selection of healthy, high-protein, and low-calorie snacks and drinks. 👯‍♀️ Team Outings: We believe in the power of connection. Join us for team outings that foster strong relationships and create lasting memories. 🏖️ Yearly Retreats: Unwind, bond, and collaborate at our annual company retreats. A time for the entire company to come together to rejuvenate and bond. 🌍 Nas Summit and Nas Travels: Employees who successfully clear probation are eligible for a choice between attending 1 Nas Summit or 1 Nas Travels trip per year, fully sponsored (T&Cs) 🚕 Transport Allowance: Employees located in Singapore and Dubai enjoy a transport allowance, making your daily commute more convenient. At Nas Company, we're committed to nurturing a supportive and engaging workplace that promotes your growth and well-being. Join us and enjoy a comprehensive array of benefits designed with you in mind Believe in our mission? Join us in building the platform for creators, by creators. Show more Show less Seniority level Internship Employment type Internship Job function Information Technology Industries IT Services and IT Consulting and Technology, Information and Internet Referrals increase your chances of interviewing at Nas Company by 2x See who you know","19":"Software Developer Singtel Singapore, Singapore 1 month ago Over 200 applicants See who Singtel has hired for this role Apply Join or sign in to find your next job Join to apply for the Software Developer role at Singtel Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? . .  Sign in to save Software Developer at Singtel . Email or phone Password Show Forgot password? Sign in Report this job At Singtel, our mission is to Empower Every Generation. We are dedicated to fostering an equitable and forward-thinking work environment where our employees experience a strong sense of Belonging, to make meaningful Impact and Grow both personally and professionally. By joining Singtel, you will be part of a caring, inclusive and diverse workforce that creates positive impact and a sustainable future for all. Be a Part of Something BIG! Group Enterprise is looking for a full stack developer, who will be part of the software development team of the Group Enterprise platforms product house, contributing on the software development for Singtel Enterprise platform and application suite. Singtel is building a unique enterprise platform completely homegrown and in this position, you will work with platforms product team. Make an Impact by Build the enterprise platform in a completely scalable fashion that can process millions of messages concurrently. Contribute to designing and developing the platform in an infrastructure agnostic fashion so that the platform can work with any network backend in a plug and play fashion. Bring in your experience in building scalable and repeatable platforms to make every component of the platform modular by design with industry grade security. Design and implement RESTful APIs to expose platform features as microservices. Build and deploy performant modern web applications in React, Redux, Webpack, ES6, and Flow Architect efficient and scalable backend systems Write unit, functional and end-to-end tests for the platform Write high-quality code (Ruby on Rails, Go, Java etc) that communicates with upstream backend services via HTTP APIs Identify and resolve performance and scalability issues Participate in code reviews In depth understanding of the whole web stack, web protocols, and web performance optimisation techniques In-depth understanding of web frameworks (such as Rails, Django, Spring etc) Detailed knowledge of minimum one modern JavaScript framework: React, Ember, Angular, etc Proficient understanding of the HTTP protocol In depth knowledge of Relational, No-SQL databases, and message queues\/brokers Understand at least one backend MVC framework - Java and Spring Boot are strongly preferred Build micro-services and understand different patterns to approach the designs. Worked on cloud platforms preferably PCF and used tools such as Docker. Experience in designing and delivering APIs and security models Excellent understanding of Message queue systems (Kafka) Monitoring and logging tools (ELK, Splunk) Front-end frameworks (React, Vue JS, Bootstrap, jQuery) Web app frameworks (Django, Drupal etc.) Databases and storage\/caching (Postgres, MongoDB, Redis) Contribute to software development and associated new technology selection and adoption. Focus areas include developing API driven features on big data, machine learning, auto scaling micro-services, scalable data storage\/retrieval. Work on architecture and software development across platform components like customer onboarding, data management, application lifecycle etc Participate on design of common platform functionality, and consistent, best-practice platform and application design. Adopt industry standard coding practises to develop the platform to ensure scalability, security and stability Participate on the move to a full SaaS deployment and management Collaborate with Business development and partnership team to develop integration adapters for third party technology and applications. Participate in technical partnership conversations and due diligence. Skills For Success Knowledge in Java (J2EE and J2SE 1.8 or higher) and Python, additional knowledge on Scala would be advantageous Expertise in HTML, CSS, Drupal, Bootstrap, Angular, JQuery, additional knowledge on Reactjs would be advantageous. Experienced in utilising Cassandra, MongoDB and Elasticsearch (At least 2). SQL databases like Postgres, MySQL Experience in source code management and build - GIT, Maven, Ant Experience in Scrum - JIRA, Confluence Experience in Messaging - Kafka, Any Pub\/Sub library Experience in containerization – Docker, Jenkins Experience in Scalable deployment – Kubernetes Experience in Learning Libraries - MLib, DL4J, H20, Tensorflow Experience in Big data Platforms - Spark (Core and Streaming) or Hadoop Experience in File Systems – HDFS Experience in Integration methods - REST API’s, messaging, WSDL, SDK’s Experience in API documents - Swagger or similar Experience developing complex, enterprise grade, configurable, scalable software products. Background in systems level thinking and design. Combined with the ability to translate technical strategy and architectures into concrete, minimal viable products, with the right trade-offs and phasing. Knowledge of relevant technologies, including messaging, relational and NoSQL databases, data modelling, analytics, IoT, and interfaces. Exposure and experience with Artificial intelligence will be a plus. Understanding of the architectural principles for cloud-based platforms that include SaaS, PaaS, multi-tenancy, infrastructure as code, and continuous availability. Experience working in an agile environment Strong written and verbal communication skills. Ability to collaborate effectively across various cross-functional teams and groups. Rewards that Go Beyond Hybrid work arrangements Full suite of health and wellness benefits Ongoing training and development programs Internal mobility opportunities Your Career Growth Starts Here. Apply Now! We are committed to a safe and healthy environment for our employees & customers and will require all prospective employees to be fully vaccinated. Show more Show less Seniority level Entry level Employment type Full-time Job function Engineering and Information Technology Industries Telecommunications Referrals increase your chances of interviewing at Singtel by 2x See who you know","20":"","21":"Software Engineer Nicoll Curtin Singapore, Singapore 2 weeks ago 56 applicants See who Nicoll Curtin has hired for this role Apply Save Save job Save this job with your existing LinkedIn profile, or create a new one. .  Sign in to save Software Engineer at Nicoll Curtin . Email or phone Password Show Forgot password? Sign in Report this job Direct message the job poster from Nicoll Curtin Kanatip Kantiwong Kanatip Kantiwong Recruitment Consultant at Nicoll Curtin - Software Engineering, Cloud, Automation We are looking for a PEGA Developer who has expertise in building PEGA Systems framework. Responsibilities Designing and developing Pega BPM applications. Designing class structures, application frameworks, and data models. Coordinating with the project team to ensure the business architecture matches the needs of the customer. Integrating business databases, legacy systems, and web services. Troubleshooting application issues, coding bugs, and bottlenecks. Integration of technical and application components to meet business requirements. Designing, coding, and testing program modules that meet design specifications. Maintaining, tuning, and repairing applications to keep them performing in accordance with technical and functional specifications. Performing preventive maintenance activities. Providing user support. Qualifications Proven work experience as a Pega developer with at least 3 years’ experience using Pegasystems framework. Preferably certified as Pega Senior System Architect (8.x). Strong understanding of Pega methodologies (Agile Scrum preferred). Experience with full lifecycle Pega implementations (Pega 8.x). Demonstrated understanding of various Pega Rules components – including: DX API, UI, Activities and Flows, Declaratives, Decision, Validation, Reports, Correspondences. Ability to troubleshoot complex software issues. This is a 12 months contract role on a full time basis. Show more Show less Seniority level Mid-Senior level Employment type Contract Job function Information Technology and Engineering Industries Information Services Referrals increase your chances of interviewing at Nicoll Curtin by 2x See who you know","22":"","23":"Software Engineer (Intern) Thales Singapore, Singapore 2 months ago Over 200 applicants See who Thales has hired for this role Apply Join or sign in to find your next job Join to apply for the Software Engineer (Intern) role at Thales Not you? Remove photo First name Last name Email Password (6+ characters) ,  ,  .   Already on LinkedIn? . .  Sign in to save Software Engineer (Intern) at Thales . Email or phone Password Show Forgot password? Sign in Report this job Location: Singapore, Singapore Thales people architect solutions at the heart of the defence-security continuum. Interoperable and secure information and telecommunications systems for defence, security, and civil operators, are based upon innovative use of radiocommunications, networks, and cybersecurity. We are ground breaking new digital technologies such as 4G mobile communications, cryptography, cloud computing and big data for use in physical protection systems, and critical information systems. Thales established its presence in Singapore in 1973 to support the expansion of aerospace-related activities in the Asia-Pacific region. Throughout the last four decades, the company grew from strength to strength and is today involved in the primary businesses of Aerospace (including Air Traffic Management), Defence & Security, Ground Transportation and Digital Identity & Security. Thales today employs over 2,100 people in Singapore across all its business areas. As a Software Engineer Intern at Thales, you will: Be part of the project team to build innovative Security solutions for Homeland Security, Smart Cities and Critical Infrastructures. Participate in the technical design, technical writing, code development, and testing for certain modules\/functionalities in the solution. Provide strong and timely support to IVVQ team and Site deployment. Gain experience on Software Development Life Cycle (SDLC) from a major government project. Gain hands-on experience on latest software\/web\/mobile technology stacks. Key requirements: Relevant knowledge, skill and experience in software\/web development Proficiency in Java, Spring Boot, .NET, Go is good-to-have. Proficiency in HTML5\/CSS, TypeScript, Angular, MQ and Apache Kafka is good-to-have. Experience with test automation tools and framework for web application is good-to-have. Experience with setting up continuous integration (e.g., GitLab CI) is good-to-have. Experience with virtualization and container and knowledge about Dockers and Kubernetes is good-to-have. If you are enthusiastic about learning new technologies and have good communication and problem-solving skills, we would love to meet you! At Thales we provide CAREERS and not only jobs. With Thales employing 80,000 employees in 68 countries our mobility policy enables thousands of employees each year to develop their careers at home and abroad, in their existing areas of expertise or by branching out into new fields. Together we believe that embracing flexibility is a smarter way of working. Great journeys start here, apply now! Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries Aviation and Aerospace Component Manufacturing and Defense and Space Manufacturing Referrals increase your chances of interviewing at Thales by 2x See who you know","24":""},"company":{"0":null,"1":null,"2":"RiDiK (a Subsidiary of CLPS. Nasdaq: CLPS)","3":null,"4":null,"5":"TikTok","6":null,"7":null,"8":"Thales","9":"Crone Corkill","10":null,"11":"e2i, Employment & Employability Institute","12":"Capgemini","13":null,"14":"Hypotenuse AI","15":null,"16":"Blackstone","17":null,"18":"Nas Company","19":"Singtel","20":null,"21":"Nicoll Curtin","22":null,"23":"Thales","24":null},"job-title":{"0":null,"1":null,"2":"Software Developer","3":null,"4":null,"5":"Software Engineer Intern, Business Infrastructure - 2024 Start","6":null,"7":null,"8":"Software Engineer Intern","9":"IT Systems Engineer","10":null,"11":"Software Engineer","12":"Junior Software Engineer","13":null,"14":"Full Stack Software Engineer Intern (6 months)","15":null,"16":"2024 Blackstone Technology and Innovations - Software Engineering Intern (Jul to Dec 2024), Singapore","17":null,"18":"Software Engineer Internship, Frontend\/Backend (Starting from May preferably) - Nas.io","19":"Software Developer","20":null,"21":"Software Engineer","22":null,"23":"Software Engineer (Intern)","24":null},"level":{"0":null,"1":null,"2":"Associate","3":null,"4":null,"5":"Not Applicable","6":null,"7":null,"8":"Not Applicable","9":"Mid-Senior level","10":null,"11":"Executive","12":"Entry level","13":null,"14":"Internship","15":null,"16":"Internship","17":null,"18":"Internship","19":"Entry level","20":null,"21":"Mid-Senior level","22":null,"23":"Not Applicable","24":null},"location":{"0":null,"1":null,"2":"Singapore, Singapore","3":null,"4":null,"5":"Singapore","6":null,"7":null,"8":"Singapore, Singapore","9":"Singapore, Singapore","10":null,"11":"Singapore, Singapore","12":"Singapore, Singapore","13":null,"14":"Singapore","15":null,"16":"Singapore","17":null,"18":"Singapore, Singapore","19":"Singapore, Singapore","20":null,"21":"Singapore, Singapore","22":null,"23":"Singapore, Singapore","24":null},"posted-time-ago":{"0":null,"1":null,"2":"1 week ago","3":null,"4":null,"5":"2 months ago","6":null,"7":null,"8":"1 month ago","9":"2 weeks ago","10":null,"11":"3 weeks ago","12":"1 month ago","13":null,"14":"6 days ago","15":null,"16":"2 weeks ago","17":null,"18":"2 weeks ago","19":"1 month ago","20":null,"21":"2 weeks ago","22":null,"23":"2 months ago","24":null},"nb_candidats":{"0":null,"1":null,"2":164.0,"3":null,"4":null,"5":177.0,"6":null,"7":null,"8":null,"9":null,"10":null,"11":null,"12":null,"13":null,"14":162.0,"15":null,"16":null,"17":null,"18":null,"19":null,"20":null,"21":56.0,"22":null,"23":null,"24":null},"scraping_date":{"0":1713830400000,"1":1713830400000,"2":1713830400000,"3":1713830400000,"4":1713830400000,"5":1713830400000,"6":1713830400000,"7":1713830400000,"8":1713830400000,"9":1713830400000,"10":1713830400000,"11":1713830400000,"12":1713830400000,"13":1713830400000,"14":1713830400000,"15":1713830400000,"16":1713830400000,"17":1713830400000,"18":1713830400000,"19":1713830400000,"20":1713830400000,"21":1713830400000,"22":1713830400000,"23":1713830400000,"24":1713830400000},"posted_date":{"0":null,"1":null,"2":1713225600000,"3":null,"4":null,"5":1708646400000,"6":null,"7":null,"8":1711238400000,"9":1712620800000,"10":null,"11":1712016000000,"12":1711238400000,"13":null,"14":1713312000000,"15":null,"16":1712620800000,"17":null,"18":1712620800000,"19":1711238400000,"20":null,"21":1712620800000,"22":null,"23":1708646400000,"24":null}}